Revit 2027 API
HermiteFace.Params Property
Parameters of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleArray this[
	int index
] { get; }
Public ReadOnly Property Params (
	index As Integer
) As DoubleArray
	Get
public:
property DoubleArray^ Params[int index] {
	DoubleArray^ get (int index);
}
member Params : DoubleArray with get
Parameters
index Int32
Property Value
DoubleArray
See Also
Reference
HermiteFace Class
Autodesk.Revit.DB Namespace